---
kind: method
id: M:Autodesk.Revit.DB.DividedPath.IsValidSpacingRuleLayout(Autodesk.Revit.DB.SpacingRuleLayout)
source: html/0fcb3940-a2ff-837f-b33e-f0cb6fa0eba8.htm
---
# Autodesk.Revit.DB.DividedPath.IsValidSpacingRuleLayout Method

Checks that the spacing rule layout enumeration value is valid

## Syntax (C#)
```csharp
public bool IsValidSpacingRuleLayout(
	SpacingRuleLayout layout
)
```

## Parameters
- **layout** (`Autodesk.Revit.DB.SpacingRuleLayout`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration